/** 1 መእተዊ … 4 መርትዖ-ናይ-ስራሕ */
export const s1: string[] = [
  `ብኢንተርነት ዝግበር ዕድግታትን ምልውዋጥን ምሉእ ብምሉእ ኣብ ሳልሳይ ኣካላት ፋይናንስያዊ ትካላት ዝተሞርኮሰ ኮይኑ ይርከብ። ወላኮ ደሓን ይሰርሕ ተሃለወ ግን ናይትድኹም ኣብ እምነት ዝተመርኮሰ ሞደል ወሪሱ ይርከብ። ፋይናንስያዊ ትካላት ኣብ ማእከል ክሳዕ ዘለዉ ምልኡ ብምሉእ ዘይምለስ ምልውዋጥ ብፍጹም ዝከኣል ኣይኮነን ። ማእከላውነት ናይዘን ትካላት ንዝግበር ምልውዋጥ ገንዘብ ክቡር ይገብሮነ ክግበር ዝከኣል ንኣሽቱ ምልውዋጣት ከኣ ትርጉም ዘይብሎም ይገብሮም ተወሳኺ ንዘይምለሱ ሰርቪሳት ዘይምለስ ክፍሊት ክትግበር ከኣ ከቢድ ይገብሮ። ምስ ናይ ምምላስ ዘሎ ተኽእሎታት ናይ ኣብ እምነት ምሙርኳስ ይውስኽ። ሸቃጦ ካብ ዓማዊል ክመጸኦም ዝኽእል ጸገማት ናይ ዝተፈላለይ ምድንጋራት ክጥንቀቁ ኣለዎም። ውሱን ሚእታዊት ናይ ምድንጋራት ከምዘይተርፍ ቅቡል ኮይኑ ይርከብ። እዚ ኩሉ ወጻኢታትን ናይ ክፍልሊእት ዘይምትእምማንን ምናልባት ብኣካል ኮይንካ ብንይ ወረቀት ገንዘብ ከተወግዶ ይከኣል ይኸውን ብዝተፈላለየ መስመራት ዝግበር ምስግጋር ገንዘብ ብዘይ ሳልሳይ ኣካል ኣይከኣልን።`,
  `እቲ ዘድሊ ኣብ ክንዲ እምነት ብክርይፕቶግራፊ መርትዖ ዝተመርኮሰ ኤለትሮኒካዊ ናይ ክፍሊት ስርዓት እዩ፡ እዚ ኸኣ ክልተ ዝተሰማምዑ ኣካላት ኣብ ማእከሎም ዘገልግል ሳልሳይ ኣካል ከየድለዮም ነንሕድሕዶም ክለዋወጡ ይኽእሉ። ምልውዋጣት ብሓይሊ ኮምፑተር ንኽትመልሶም ዘይከኣል ብምግባር ንሸየጥቲ ካብ ዘኾነ ምድንጋር ይከላኸል፣ ንገዛእቲ ዝከላኸል ስሩዕ ኣገባባት ይተኣታቶ። ኣብዚ ጽሑፍ ብካብ መዘና-ናብ-መዘና ዝግበር ምልዋጥ ተጠቂምካ ንካልኣይ ግዜ ናይ ምጥቃም ብናይ ግዜ-ማሕተም ሰርቨር ተጠቂምካ ኮምፑተራዊ መርትዖ ናይ ቅድመ ተኸተል ኣመጻጽኣ ምልውዋጣት የፍሪ። እዚ ቴክኖሎጂ ክሳብ ቅኑዓት ኖድስ ተእኪቦም ብዝህብዎ ናይ ኮምፑተር ሓይሊ ካብ ዝተፈላለዩ ናይ መጥቃዕቲ ግሩፓት ነጻ ክኸውን እዩ፡`,
];

export const s2: string[] = [
  `ኤለትሮኒካዊ ሳንቲም ከም ሓደ ሰንሰለታዊ ናይ ድግታላዊ ፌርማ ኢልና ንግለጾ። ነፍስወከፍ ወናኒ እዚ ሰናቲም ናብ ካልእ ክሰድድ ከሎ ናይታ ቅድሚኣ ዝነበረት ምልውዋጥ ሃሽ ብምግባር ናይ ቀጻሊ ተቀባሊ መፍትሕ public ናብታ ሳንቲም ይውሰኽ። እቲ ከፋሊ ነዚ ፌርማታት ብምክትታል ነዚ ሰንሰለታዊ ዋንነት ከረጋግጽ ይኽእል እዩ።`,
  `እቲ ጸገም ብልክዕ እቲ ተኸፋሊ እቲ ወናኒ ቅድሚ ሕጂ ተጠቂምላ ዳግመ ምጥቃም ዝነበር ሳንቲም ከይትኸውን ከረጋግጽ እይክእልን እዩ። እቲ ፍሉጥ መፍትሒ ሓደ ማእከላይ ዝእመን ኣመሓዳሪ ንኹሉ ምልውዋጣት ካብ ዳግመ ምጥቃም ዝምርምር ምትእትታው እዩ። ነፍሲወከፍ ሳንቲም ድሕሪ ምስግጋር ናብቲ ኣካል ይምለስ እሞ ብልክዕ ብእኡ ዝወጸ ዘበለ ሳንቲም ከኣ ካብ ዳግመ ምጥቃም ናጻ ምዃኑ ክእመን ይከኣል። ናይዚ ጸገም ዕጫ ናይዚ ኹሉ ናይ ገንዘብ ኣሰራርሓ ግን ኩሉ ምስግጋራት ኣብቲ ትካል ዝተመርኮሰ ይኸውን ልክዕ ከም ባንክታት።`,
  `እዚ ተቀባሊ ካሊእ እቲ ሰዳዲ ነዚ ገንዘብ ቅድሚ ሕጂ ከምዘይተጠቀመሉን ከምዘይፈረመሉን ዘረጋግጸሉ መገዲ ክህሉ ኣለዎ ። ንዕላማና እታ ቀዳመይቲ ምስግጋር እያ ተገድስ ድሕሩ ክመጽእ ዝኽእል ናይ ዳግማይ ምጥቃም ፈተነታት ኣይከገድስን እዩ። እታ ሓንቂ ህላውነት ናይቲ ዝተገብረ ምስግጋራት ከነረጋግጸላ ንኽእል መገዲ ንኹሉ ዝግበር ምስግጋር ምፍላጥ እዩ። ኣብቲ ናይ ትካል ዘልዓልናዮ ሞዴል ኩሎም ምስግጋራት እቲ ትካል ይፈልጦም እዩ ኣይናይ ቀደሙ መጺኡ ውን ይውስን። ነዚ ብዘይ ትካል ከተማልእ ምስግጋራት ብዕሊ ህዝባዉ መገዲ ክስደዱ ኣለዎም [1] ኣብዝይ ስርዓት ወይ ስይስተም ተሳተፍቲ ከኣ ኣብ ሓደ ስርዓት ናይ ኣመጻጽኣኦም ክሰማምዑ ኣለዎም። እቲ ተቀባሊ ኣብ ነፍስወከፍ ናይ ምስግጋር እዋን ዘበዝሑ እቶም ኖድስ ቀዳመይት ዝተቀበለት ምዃና መርትዖ ከቅርቡ ኣለዎም።`,
];

export const s3: string[] = [
  `እዚ ነቅርቦ መፍትሒ ብናይ ግዜ ማሕተም ኣገልግሎት ይጅምር። ናይ ግዜ ማሕተም ኣገልግሎት ነቲ ሃሽ ናይ ነገራት ብሎክ ብሕታም ብዕሊ ከምዝሕተም ገርካ ይሰርሕ፣ ልክዕከም ጋዜጣ ወይ Usenet post [2-5] ። እዚ ናይ ግዜ ማሕተም እዚ ዳታ ኣበይናይ ግዜ ከምዝነበረ የርጋግጽ ናብቲ ሃሽ ንምሕዋስ ማለት’ዩ። ነፍስወከፍ ናይ ግዜ ማሕተም ናይ ቅድሚኣ ዝነበርት ናይ ግዜ ማሕተም ሃሽ ብምምዝጋብ ሓደ ሰንሰለት ይፈጥር ኣብ ነፍስወከፍ ናይ ግዜ ማሕተም ከኣ ነተን ዝሓለፋ እንዳኣደልደለ ይኸይድ`,
];

export const s4: string[] = [
  `እዚ ናይ ግዜ ማሕተም ኣብ ናይ መዘና ምስ መዘና ከተታኣታትዎ ልክዕ ከም ናይ ኣዳም ባክ ሃሽካሽ [6] ዝመሳሰል መርትዖ ናይ ስራሕ ክትጥቀም ከድሊ እዩ ዘይከም ናይ ጋዜጣ ወይ ዩዝነት [Usenet] ፖስትታት። እዚ መርትዖ ናይ ስራሕ ብሓሳብ ሻ256 ተጠቂምካ ዝግበር ቁጽሪ ብምድላይን ምርካብን ይስራሕ ፣እቲ ሃሽ ድማ ካብ ዜሮ ቢት ይጅምር። እቲ ዘዲሊ ማእከላይ ስራሕ ካብተን ተዋሂበን ዘለዋ ዜሮታት ተበጊስካ ብቅልጡፍ ነቲ ሃሽ ምርካብ እዩ ንምርግጋጽ በቀሊሉ ብሓንቂ ሃሽ ይከኣል እዩ።`,
  `ነዚ ናይ ናይ ግዜ ማሕተም መስመርና ፣ መርትዖ ናይ ስራሕ ብምትእትታው ነቲ ኖንስ ኣብ ብሎክ ዘሎ ዳወሰኽካ ክሳብ ልክዕ ናይቲ ብሎክ ሃሽ ብዝተውሰነ ዘሮ ዘለዎ ዝርከብ ይቅጽል። ሓንሳብ እቲ ናይ ኮምፑተራት ነቲ ናይ ስርሕ መርትዖ ንምዕጋብ ዝገብርኦ ጻዕሪ ምስተራእየ እቲ ብሎክ ክቅየር ከምዘይክል ይኸውን ወይ ከምብሓድሽ ነቲ ስራሕ ክትሰርሖ ኣለካ ። ዝቅጽሉ ኩሎም ብሎካት ነንሕድሕዶም ስለ ዝተኣሳሰሩ ነታ ብሎክ ክትቅይር ተኾይንካ ንኹሉ እቶም ቀጺሎም ዘለዉ ብሎካት ክትቅይር ኣለካ ።`,
  `እዚ መርትዖ ናይ ስራሕ ዘውሃብ ውሳኔታት ኣብ ከመይ ተመርኩስካ ከምዝወሃብ ዘሎ ጸገም ውን ይፈትሕ። እቲ ውሳኔ ዝበዝሐ ኣብ ሓደ ኣድራሻ IP ሓደ ድምጺ ዝተመርኮሰ እንተዝኸውን ብዝኾነ ብዙሕ ኣድራሻታት ክግልበጥ ይኽእል ነይሩ። ናይ ስራሕ መርትዖ ግን ሓንቲ ኮምፑተር ሓንቲ ድምጺ እዩ። እቲ ውሳኔታት በቲ ዝነወሐ ሰንሰለት ናይ ብዙሓት ዓቢ ናይ ስራሕ መርትዖ ዝሓዘ ጻዕርታት ይውሰን። እቲ ዝበዝሕ ናይ ኮምፑተራት ጻዕሪ ብቅኑዓት ኖድስ እንድሕር ተታሒዙ፡ እቲ ቅኑዕ ሰንሰለት ብቅልጡፍ ክዓብን ካልኦት ሰንሰለታት ከወጻጽኦም እዩ። ዝኾነ ከጥቅዕ ኢሉ ዝመጽእ ከኣ ነዚ ኹሉ ናይ ስራሕ መርትዖ ናይታ ብሎክን ድሕሪኣ ዝተሰርሓ ብሎካትን ደጊሙ ሰሪሑ ነቶም ቅኑዓት ኖድስ ኣርኪቡ ክሓልፎም ተኺኢሉ ጥራሕ እዩ። ጸንሓና ናይ ሓደ ዝሑል መጥቃዕቲ ከመይ ጌሩ ኣብ ነፍሲ ወከፍ ብሎክ ክውሰኽ ከሎ ብዝያዳ ዕድሉ ከም ዝጸብብ ክንርኢ ኢና።`,
  `ምስግዜ ዝመጽእ ናይ ሃርድዌራት ቅልጣፈን ድሌት ናይ ናትካ ኖድ ምድላውን ንምዝናቕ ድማ እቲ ክብደት ናይ መርትዖ ናይ ስራሕ ነቲ ኣብ ሓደ ሰዓት ዝስርሑ ብሎካት ብኣቨረጅ ቁጽሪ ዕላማ ብምግባር ይውሰን። ብሎካት ብቅልጡፍ ክወጹ ተጀሚሮም ነቲ ክብደት ይውሰኽ።`,
];
